[
  {
    "name": "Frontend Engineer at EltaVR",
    "year": "2020 - Ongoing",
    "desc": "Completely recreated the website of Elta VR, using React and other libraries. Worked on the pages; sign-in/up, home,analytics, organization, profile. This website is used to create 360° tours of buildings to have virtual tours in them. "
  },
  {
    "name": "Data Scientist & Frontend Engineering Associate at Anodot",
    "year": "2019 - 2019",
    "desc": "Created a UI, using React, R and JavaScript, that helped interpret the anomaly data easily and made the process of interpreting more accessible and ergonomically advanced. This UI was used by the Sales Engineers to help explain the main product of Anodot, the anomaly detection, to the customers."
  },
  {
    "name": "Founder and Software Engineer at hymn",
    "year": "2018 - 2020",
    "desc": "Worked on the music service hymn. Managed the start-up and worked on the Front-End interfaces as well as API integration. The start-up was selected to the Garage Residency program at Northwestern University. The APIs are displayed on the right."
  },
  {
    "name": "Co-Founder and Software Engineer at Hearo",
    "year": "2018 - 2018",
    "desc": "Was part of the team that created the transcription app Hearo. Worked on the navigation part, the calling part and several other front-end side developments of the application. The app is displayed on the right."
  },
  {
    "name": "Peer Mentor at Northwestern University",
    "year": "2017 - 2020",
    "desc": "Peer mentored in the classes 'Fundamentals of Computer Programming I & II', 'Introduction to Artificial Intelligence' and Human Computer Interaction at Northwestern University."
  },
  {
    "name": "Front-End Engineering Intern at Inveon",
    "year": "2017 - 2017",
    "desc": "Worked on translating an application to React Native and bugfixes, added several other features including Google Firebase Analytics."
  },
  {
    "name": "Web Developer Intern at Pixelsoft Office",
    "year": "2014 - 2014",
    "desc": "Worked on the creation the Coca Cola machine interface at Turkey and editted websites the company worked on."
  }
]
